//За допомогою механізму успадкування, реалізуйте клас Aspirant, 
//похідний від Student(аспірант - це студент, який готується 
//до захисту кандидатської роботи).
//Тема кандидатської роботи - звичайне поле типу string.
//Переконатися в наявності 1 - 2 конструкторів, 
//і всіх необхідних геттерів / сеттерів у кожному з двох класів.
//Застосувати виклик конструктора базового класу, 
//а також для виклику 1 - 2 інших методів(наприклад, Print).
//
//Створіть клас Passport(паспорт), який міститиме паспортну інформацію про громадянина України.
//За допомогою механізму успадкування, реалізуйте клас ForeignPassport(Закордонний паспорт), 
//похідний від Passport.Загран.паспорт містить крім паспортних даних, також дані про візи.
//Віза має бути представлена окремим класом.
//
//Створіть базовий клас Транспорт і його дочірні класи 
//Автомобіль, Таксі, Трамвай, Тролейбус, Маршрутка, Електросамокат, Поїзд, Літак, Велосипед.
//Створіть методи для розрахунку часу та вартості поїздки з Одеси до Харкова.
//
//Створіть базовий клас Фігура.Створіть похідні від нього Точка, Пряма, Еліпс, Багатокутник.
//Створіть похідний від Еліпса клас Коло.
//Створіть похідні від Багатокутника класи Трикутник і Чотирикутник.
//Створіть похідні від Трикутника класи 
//- ЗвичайнийГострокутнийТрикутник, 
//- РівнобедренийГострокутнийТрикутник, 
//- РівностороннійГострокутнийТрикутник, 
//- ЗвичайнийТупокутнийТрикутник, 
//- РівнобедренийТупокутнийТрикутник, 
//- ЗвичайнийПрямокутнийТрикутник, 
//- РівнобедренийПрямокутнийТрикутник.
//Створіть похідні від Чотирикутника класи 
//- Паралелограм, 
//- Трапеція, 
//- Дельтоїд.
//Створіть похідні від Паралелограма класи Прямокутник і Ромб.
//Створіть похідний від Прямокутника клас Квадрат.
//У базовому класі Фігура потрібно зробити методи Площа, Периметр, Намалювати.
//У похідних класах - перевизначити ці методи.
//
//Створіть базовий клас Pen с з методом Draw, 
//який відповідатиме за налаштування контуру(є поля : колір, товщина, тип).
//Створіть базовий клас Brush з методом Fill, який відповідає за налаштування заливки(є поля : колір).
//Створіть п'ять класів-спадкоємців класу Brush - 
//- SolidBrush, 
//- GradientBrush (додається масив кольорів), 
//- MatchBrush (додається другий колір і тип візерунка), 
//- TextureBrush (додається рядковий шлях до картинки),
//- VisualBrush (додається рядковий ідентифікатор елемента управління). 
//Створіть два класи-спадкоємці GradientBrush - 
//- LinearGradientBrush 
//- RadialGradientBrush. 
//Створіть базовий клас Geometry з полями типу Pen і Brush*. 
//Створіть похідні від Geometry класи Rectangle, Ellipse і Polyline. 
//Створіть клас Font, з такими параметрами, як 
//- розмір шрифту, 
//- сімейство шрифту, 
//- жирність, 
//- курсив, 
//- підкресленість, 
//- колір тексту шрифту. 
//- На основі деяких за допомоги множинного успадкування із цих типів спробуйте створити 
//- клас Button, для відображення кнопки (на кнопці має бути текст)!

#include <iostream>

int main()
{
    
}

